package Ch12;

public class C00Info {
	// 상속(물려줌 - 계층 구조)
	// 상위 (부모, super)클래스의 속성과 기능을 하위(자식, sub)클래스에서
	// 그대로 물려받아 사용할 수 있도록 허용한 문법
	
	// extends : 상위 클래스보다 더 많은 속성을 확장하는 개념

	// 상위 클래스로부터 속성, 기능을 물려받은 하위 클래스는 그 외의 속성, 기능을 추가할 수 있다.
	// 상위 클래스로부터 속성, 기능을 물려받은 하위 클래스는 물려받은 기능을 고쳐서 사용할 수 있다.(오버라이딩)
	// extends 예약어 사용
	
	// 일반어			구체어
	// 동물			강아지	포메, 푸들
	//				고양이	샴, 페르시안
	// 상속 관계 표시할때 화살표는 상위 개체를 향함
	
	// 상속 쓰는 이유?
	// 1. 확장성		: 추가하기 용이함
	// 2. 유지보수 용이 
	// 3. 가독성
	// 4. 코드 중복 최소화
	
	
	
	
	
	
	
	
	
}
